zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211axx_ca35.h
/******************  Bit definition for FMC_SEMCR4 register  ******************/
#define FMC_SEMCR4_SEM_MUTEX_Pos      (0U)
#define FMC_SEMCR4_SEM_MUTEX_Msk      (0x1UL << FMC_SEMCR4_SEM_MUTEX_Pos)     /*!< 0x00000001 */
#define FMC_SEMCR4_SEM_MUTEX          FMC_SEMCR4_SEM_MUTEX_Msk               /*!< Mutex for the CID allocation of Resource x in semaphore mode */
#define FMC_SEMCR4_SEMCID_Pos         (4U)
#define FMC_SEMCR4_SEMCID_Msk         (0x7UL << FMC_SEMCR4_SEMCID_Pos)        /*!< 0x00000070 */
#define FMC_SEMCR4_SEMCID             FMC_SEMCR4_SEMCID_Msk                  /*!< Current CID allocated to resource x in semaphore mode */

/*****************  Bit definition for FMC_CIDCFGR5 register  *****************/
#define FMC_CIDCFGR5_CFEN_Pos         (0U)
#define FMC_CIDCFGR5_CFEN_Msk         (0x1UL << FMC_CIDCFGR5_CFEN_Pos)        /*!< 0x00000001 */
#define FMC_CIDCFGR5_CFEN             FMC_CIDCFGR5_CFEN_Msk                  /*!< CID filtering enable for resource 5 */
#define FMC_CIDCFGR5_SEMEN_Pos        (1U)
#define FMC_CIDCFGR5_SEMEN_Msk        (0x1UL << FMC_CIDCFGR5_SEMEN_Pos)       /*!< 0x00000002 */
#define FMC_CIDCFGR5_SEMEN            FMC_CIDCFGR5_SEMEN_Msk                 /*!< Semaphore enable for resource 5 */
#define FMC_CIDCFGR5_SCID_Pos         (4U)
#define FMC_CIDCFGR5_SCID_Msk         (0x7UL << FMC_CIDCFGR5_SCID_Pos)        /*!< 0x00000070 */
#define FMC_CIDCFGR5_SCID             FMC_CIDCFGR5_SCID_Msk                  /*!< Static CID for resource 5 */
#define FMC_CIDCFGR5_PRDEN_Pos        (14U)
#define FMC_CIDCFGR5_PRDEN_Msk        (0x1UL << FMC_CIDCFGR5_PRDEN_Pos)       /*!< 0x00004000 */
#define FMC_CIDCFGR5_PRDEN            FMC_CIDCFGR5_PRDEN_Msk                 /*!< Public read enable */
#define FMC_CIDCFGR5_SEMWLC0_Pos      (16U)
#define FMC_CIDCFGR5_SEMWLC0_Msk      (0x1UL << FMC_CIDCFGR5_SEMWLC0_Pos)     /*!< 0x00010000 */
#define FMC_CIDCFGR5_SEMWLC0          FMC_CIDCFGR5_SEMWLC0_Msk               /*!< white-listed CID0 in the CID allocation pool of resource 5 in semaphore mode */
#define FMC_CIDCFGR5_SEMWLC1_Pos      (17U)
#define FMC_CIDCFGR5_SEMWLC1_Msk      (0x1UL << FMC_CIDCFGR5_SEMWLC1_Pos)     /*!< 0x00020000 */
#define FMC_CIDCFGR5_SEMWLC1          FMC_CIDCFGR5_SEMWLC1_Msk               /*!< white-listed CID0 in the CID allocation pool of resource 5 in semaphore mode */
#define FMC_CIDCFGR5_SEMWLC2_Pos      (18U)
#define FMC_CIDCFGR5_SEMWLC2_Msk      (0x1UL << FMC_CIDCFGR5_SEMWLC2_Pos)     /*!< 0x00040000 */
#define FMC_CIDCFGR5_SEMWLC2          FMC_CIDCFGR5_SEMWLC2_Msk               /*!< white-listed CID in the CID allocation pool of resource 5 in semaphore mode */
#define FMC_CIDCFGR5_SEMWLC3_Pos      (19U)
#define FMC_CIDCFGR5_SEMWLC3_Msk      (0x1UL << FMC_CIDCFGR5_SEMWLC3_Pos)     /*!< 0x00080000 */
#define FMC_CIDCFGR5_SEMWLC3          FMC_CIDCFGR5_SEMWLC3_Msk               /*!< white-listed CID in the CID allocation pool of resource 5 in semaphore mode */
#define FMC_CIDCFGR5_SEMWLC4_Pos      (20U)
#define FMC_CIDCFGR5_SEMWLC4_Msk      (0x1UL << FMC_CIDCFGR5_SEMWLC4_Pos)     /*!< 0x00100000 */
#define FMC_CIDCFGR5_SEMWLC4          FMC_CIDCFGR5_SEMWLC4_Msk               /*!< white-listed CID0 in the CID allocation pool of resource 5 in semaphore mode */
#define FMC_CIDCFGR5_SEMWLC5_Pos      (21U)
#define FMC_CIDCFGR5_SEMWLC5_Msk      (0x1UL << FMC_CIDCFGR5_SEMWLC5_Pos)     /*!< 0x00200000 */
#define FMC_CIDCFGR5_SEMWLC5          FMC_CIDCFGR5_SEMWLC5_Msk               /*!< white-listed CID0 in the CID allocation pool of resource 5 in semaphore mode */
#define FMC_CIDCFGR5_SEMWLC6_Pos      (22U)
#define FMC_CIDCFGR5_SEMWLC6_Msk      (0x1UL << FMC_CIDCFGR5_SEMWLC6_Pos)     /*!< 0x00400000 */
#define FMC_CIDCFGR5_SEMWLC6          FMC_CIDCFGR5_SEMWLC6_Msk               /*!< white-listed CID0 in the CID allocation pool of resource 5 in semaphore mode */
#define FMC_CIDCFGR5_SEMWLC7_Pos      (23U)
#define FMC_CIDCFGR5_SEMWLC7_Msk      (0x1UL << FMC_CIDCFGR5_SEMWLC7_Pos)     /*!< 0x00800000 */
#define FMC_CIDCFGR5_SEMWLC7          FMC_CIDCFGR5_SEMWLC7_Msk               /*!< White-listed CID0 in the CID allocation pool of resource 5 in semaphore mode */

/******************  Bit definition for FMC_SEMCR5 register  ******************/
#define FMC_SEMCR5_SEM_MUTEX_Pos      (0U)
#define FMC_SEMCR5_SEM_MUTEX_Msk      (0x1UL << FMC_SEMCR5_SEM_MUTEX_Pos)     /*!< 0x00000001 */
#define FMC_SEMCR5_SEM_MUTEX          FMC_SEMCR5_SEM_MUTEX_Msk               /*!< Mutex for the CID allocation of resource 5 in semaphore mode */
#define FMC_SEMCR5_SEMCID_Pos         (4U)
#define FMC_SEMCR5_SEMCID_Msk         (0x7UL << FMC_SEMCR5_SEMCID_Pos)        /*!< 0x00000070 */
#define FMC_SEMCR5_SEMCID             FMC_SEMCR5_SEMCID_Msk                  /*!< Current CID allocated to resource 5 in semaphore mode */

/*****************  Bit definition for FMC_HWCFGR3 register  ******************/
#define FMC_HWCFGR3_CID_WIDTH_Pos     (0U)
#define FMC_HWCFGR3_CID_WIDTH_Msk     (0xFUL << FMC_HWCFGR3_CID_WIDTH_Pos)    /*!< 0x0000000F */
#define FMC_HWCFGR3_CID_WIDTH         FMC_HWCFGR3_CID_WIDTH_Msk              /*!< CID bus width (width to reconsider) */

/***************  Bit definition for FMC_HWCFGR2 register  ****************/
#define FMC_HWCFGR2_RD_LN2DPTH_Pos    (0U)
#define FMC_HWCFGR2_RD_LN2DPTH_Msk    (0xFUL << FMC_HWCFGR2_RD_LN2DPTH_Pos)   /*!< 0x0000000F */
#define FMC_HWCFGR2_RD_LN2DPTH        FMC_HWCFGR2_RD_LN2DPTH_Msk             /*!< AXI read data FIFO depth */
#define FMC_HWCFGR2_NOR_BASE_Pos      (4U)
#define FMC_HWCFGR2_NOR_BASE_Msk      (0xFUL << FMC_HWCFGR2_NOR_BASE_Pos)     /*!< 0x000000F0 */
#define FMC_HWCFGR2_NOR_BASE          FMC_HWCFGR2_NOR_BASE_Msk               /*!< NOR base address */
#define FMC_HWCFGR2_SDRAM_RBASE_Pos   (8U)
#define FMC_HWCFGR2_SDRAM_RBASE_Msk   (0xFUL << FMC_HWCFGR2_SDRAM_RBASE_Pos)  /*!< 0x00000F00 */
#define FMC_HWCFGR2_SDRAM_RBASE       FMC_HWCFGR2_SDRAM_RBASE_Msk            /*!< SDRAM remap base address */
#define FMC_HWCFGR2_NAND_BASE_Pos     (12U)
#define FMC_HWCFGR2_NAND_BASE_Msk     (0xFUL << FMC_HWCFGR2_NAND_BASE_Pos)    /*!< 0x0000F000 */
#define FMC_HWCFGR2_NAND_BASE         FMC_HWCFGR2_NAND_BASE_Msk              /*!< NAND base address */
#define FMC_HWCFGR2_SDRAM1_BASE_Pos   (16U)
#define FMC_HWCFGR2_SDRAM1_BASE_Msk   (0xFUL << FMC_HWCFGR2_SDRAM1_BASE_Pos)  /*!< 0x000F0000 */
#define FMC_HWCFGR2_SDRAM1_BASE       FMC_HWCFGR2_SDRAM1_BASE_Msk            /*!< SDRAM Bank1 base address */
#define FMC_HWCFGR2_SDRAM2_BASE_Pos   (20U)
#define FMC_HWCFGR2_SDRAM2_BASE_Msk   (0xFUL << FMC_HWCFGR2_SDRAM2_BASE_Pos)  /*!< 0x00F00000 */
#define FMC_HWCFGR2_SDRAM2_BASE       FMC_HWCFGR2_SDRAM2_BASE_Msk            /*!< SDRAM Bank2 base address */
#define FMC_HWCFGR2_TRUSTZONE_Pos     (24U)
#define FMC_HWCFGR2_TRUSTZONE_Msk     (0x1UL << FMC_HWCFGR2_TRUSTZONE_Pos)    /*!< 0x01000000 */
#define FMC_HWCFGR2_TRUSTZONE         FMC_HWCFGR2_TRUSTZONE_Msk              /*!< Support for TrustZone */
#define FMC_HWCFGR2_MAX_CID_Pos       (28U)
#define FMC_HWCFGR2_MAX_CID_Msk       (0xFUL << FMC_HWCFGR2_MAX_CID_Pos)      /*!< 0xF0000000 */
#define FMC_HWCFGR2_MAX_CID           FMC_HWCFGR2_MAX_CID_Msk                /*!< Maximum compartment ID (also known as CID) */

/***************  Bit definition for FMC_HWCFGR1 register  ****************/
#define FMC_HWCFGR1_NAND_SEL_Pos      (0U)
#define FMC_HWCFGR1_NAND_SEL_Msk      (0x1UL << FMC_HWCFGR1_NAND_SEL_Pos)     /*!< 0x00000001 */
#define FMC_HWCFGR1_NAND_SEL          FMC_HWCFGR1_NAND_SEL_Msk               /*!< NAND Controller Selection */
#define FMC_HWCFGR1_NAND_ECC_Pos      (4U)
#define FMC_HWCFGR1_NAND_ECC_Msk      (0x1UL << FMC_HWCFGR1_NAND_ECC_Pos)     /*!< 0x00000010 */
#define FMC_HWCFGR1_NAND_ECC          FMC_HWCFGR1_NAND_ECC_Msk               /*!< NAND ECC */
#define FMC_HWCFGR1_SDRAM_SEL_Pos     (8U)
#define FMC_HWCFGR1_SDRAM_SEL_Msk     (0x1UL << FMC_HWCFGR1_SDRAM_SEL_Pos)    /*!< 0x00000100 */
#define FMC_HWCFGR1_SDRAM_SEL         FMC_HWCFGR1_SDRAM_SEL_Msk              /*!< SDRAM controller selection */
#define FMC_HWCFGR1_ID_SIZE_Pos       (12U)
#define FMC_HWCFGR1_ID_SIZE_Msk       (0xFUL << FMC_HWCFGR1_ID_SIZE_Pos)      /*!< 0x0000F000 */
#define FMC_HWCFGR1_ID_SIZE           FMC_HWCFGR1_ID_SIZE_Msk                /*!< AXI ID signals width */
#define FMC_HWCFGR1_WA_LN2DPTH_Pos    (16U)
#define FMC_HWCFGR1_WA_LN2DPTH_Msk    (0xFUL << FMC_HWCFGR1_WA_LN2DPTH_Pos)   /*!< 0x000F0000 */
#define FMC_HWCFGR1_WA_LN2DPTH        FMC_HWCFGR1_WA_LN2DPTH_Msk             /*!< AXI write address FIFO depth */
#define FMC_HWCFGR1_WD_LN2DPTH_Pos    (20U)
#define FMC_HWCFGR1_WD_LN2DPTH_Msk    (0xFUL << FMC_HWCFGR1_WD_LN2DPTH_Pos)   /*!< 0x00F00000 */
#define FMC_HWCFGR1_WD_LN2DPTH        FMC_HWCFGR1_WD_LN2DPTH_Msk             /*!< AXI write data FIFO depth */
#define FMC_HWCFGR1_WR_LN2DPTH_Pos    (24U)
#define FMC_HWCFGR1_WR_LN2DPTH_Msk    (0xFUL << FMC_HWCFGR1_WR_LN2DPTH_Pos)   /*!< 0x0F000000 */
#define FMC_HWCFGR1_WR_LN2DPTH        FMC_HWCFGR1_WR_LN2DPTH_Msk             /*!< AXI write response FIFO depth */
#define FMC_HWCFGR1_RA_LN2DPTH_Pos    (28U)
#define FMC_HWCFGR1_RA_LN2DPTH_Msk    (0xFUL << FMC_HWCFGR1_RA_LN2DPTH_Pos)   /*!< 0xF0000000 */
#define FMC_HWCFGR1_RA_LN2DPTH        FMC_HWCFGR1_RA_LN2DPTH_Msk             /*!< AXI read address FIFO depth */

/*****************  Bit definition for FMC_VERR register  *****************/
#define FMC_VERR_MINREV_Pos           (0U)
#define FMC_VERR_MINREV_Msk           (0xFUL << FMC_VERR_MINREV_Pos)          /*!< 0x0000000F */
#define FMC_VERR_MINREV               FMC_VERR_MINREV_Msk                    /*!< Minor revision */
#define FMC_VERR_MAJREV_Pos           (4U)
#define FMC_VERR_MAJREV_Msk           (0xFUL << FMC_VERR_MAJREV_Pos)          /*!< 0x000000F0 */
#define FMC_VERR_MAJREV               FMC_VERR_MAJREV_Msk                    /*!< Major revision */

/****************  Bit definition for FMC_IPIDR register  *****************/
#define FMC_IPIDR_ID_Pos              (0U)
#define FMC_IPIDR_ID_Msk              (0xFFFFFFFFUL << FMC_IPIDR_ID_Pos)      /*!< 0xFFFFFFFF */
#define FMC_IPIDR_ID                  FMC_IPIDR_ID_Msk                       /*!< FMC Identifier */

/*****************  Bit definition for FMC_SIDR register  *****************/
#define FMC_SIDR_SID_Pos              (0U)
#define FMC_SIDR_SID_Msk              (0xFFFFFFFFUL << FMC_SIDR_SID_Pos)      /*!< 0xFFFFFFFF */
#define FMC_SIDR_SID                  FMC_SIDR_SID_Msk                       /*!< Size Identification */

/******************************************************************************/
/*                                                                            */
/*                            General Purpose I/O                             */
/*                          c7amba_ioport4 Rev 1.0.2                          */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for GPIO_MODER register  ******************/
#define GPIO_MODER_MODE0_Pos           (0U)
#define GPIO_MODER_MODE0_Msk           (0x3UL << GPIO_MODER_MODE0_Pos)           /*!< 0x00000003 */
#define GPIO_MODER_MODE0               GPIO_MODER_MODE0_Msk                     /*!< [1:0]: Port x configuration I/O pin y (y=0 to 15)These bits are written by software to configure the I/O mode.Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_MODER_MODE1_Pos           (2U)
#define GPIO_MODER_MODE1_Msk           (0x3UL << GPIO_MODER_MODE1_Pos)           /*!< 0x0000000C */
#define GPIO_MODER_MODE1               GPIO_MODER_MODE1_Msk                     /*!< [1:0]: Port x configuration I/O pin y (y=0 to 15)These bits are written by software to configure the I/O mode.Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_MODER_MODE2_Pos           (4U)
#define GPIO_MODER_MODE2_Msk           (0x3UL << GPIO_MODER_MODE2_Pos)           /*!< 0x00000030 */
#define GPIO_MODER_MODE2               GPIO_MODER_MODE2_Msk                     /*!< [1:0]: Port x configuration I/O pin y (y=0 to 15)These bits are written by software to configure the I/O mode.Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_MODER_MODE3_Pos           (6U)
#define GPIO_MODER_MODE3_Msk           (0x3UL << GPIO_MODER_MODE3_Pos)           /*!< 0x000000C0 */
#define GPIO_MODER_MODE3               GPIO_MODER_MODE3_Msk                     /*!< [1:0]: Port x configuration I/O pin y (y=0 to 15)These bits are written by software to configure the I/O mode.Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_MODER_MODE4_Pos           (8U)
#define GPIO_MODER_MODE4_Msk           (0x3UL << GPIO_MODER_MODE4_Pos)           /*!< 0x00000300 */
#define GPIO_MODER_MODE4               GPIO_MODER_MODE4_Msk                     /*!< [1:0]: Port x configuration I/O pin y (y=0 to 15)These bits are written by software to configure the I/O mode.Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_MODER_MODE5_Pos           (10U)
#define GPIO_MODER_MODE5_Msk           (0x3UL << GPIO_MODER_MODE5_Pos)           /*!< 0x00000C00 */
#define GPIO_MODER_MODE5               GPIO_MODER_MODE5_Msk                     /*!< [1:0]: Port x configuration I/O pin y (y=0 to 15)These bits are written by software to configure the I/O mode.Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_MODER_MODE6_Pos           (12U)
#define GPIO_MODER_MODE6_Msk           (0x3UL << GPIO_MODER_MODE6_Pos)           /*!< 0x00003000 */
#define GPIO_MODER_MODE6               GPIO_MODER_MODE6_Msk                     /*!< [1:0]: Port x configuration I/O pin y (y=0 to 15)These bits are written by software to configure the I/O mode.Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_MODER_MODE7_Pos           (14U)
#define GPIO_MODER_MODE7_Msk           (0x3UL << GPIO_MODER_MODE7_Pos)           /*!< 0x0000C000 */
#define GPIO_MODER_MODE7               GPIO_MODER_MODE7_Msk                     /*!< [1:0]: Port x configuration I/O pin y (y=0 to 15)These bits are written by software to configure the I/O mode.Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_MODER_MODE8_Pos           (16U)
#define GPIO_MODER_MODE8_Msk           (0x3UL << GPIO_MODER_MODE8_Pos)           /*!< 0x00030000 */
#define GPIO_MODER_MODE8               GPIO_MODER_MODE8_Msk                     /*!< [1:0]: Port x configuration I/O pin y (y=0 to 15)These bits are written by software to configure the I/O mode.Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_MODER_MODE9_Pos           (18U)
#define GPIO_MODER_MODE9_Msk           (0x3UL << GPIO_MODER_MODE9_Pos)           /*!< 0x000C0000 */
#define GPIO_MODER_MODE9               GPIO_MODER_MODE9_Msk                     /*!< [1:0]: Port x configuration I/O pin y (y=0 to 15)These bits are written by software to configure the I/O mode.Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_MODER_MODE10_Pos          (20U)
#define GPIO_MODER_MODE10_Msk          (0x3UL << GPIO_MODER_MODE10_Pos)          /*!< 0x00300000 */
#define GPIO_MODER_MODE10              GPIO_MODER_MODE10_Msk                    /*!< [1:0]: Port x configuration I/O pin y (y=0 to 15)These bits are written by software to configure the I/O mode.Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_MODER_MODE11_Pos          (22U)
#define GPIO_MODER_MODE11_Msk          (0x3UL << GPIO_MODER_MODE11_Pos)          /*!< 0x00C00000 */
#define GPIO_MODER_MODE11              GPIO_MODER_MODE11_Msk                    /*!< [1:0]: Port x configuration I/O pin y (y=0 to 15)These bits are written by software to configure the I/O mode.Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_MODER_MODE12_Pos          (24U)
#define GPIO_MODER_MODE12_Msk          (0x3UL << GPIO_MODER_MODE12_Pos)          /*!< 0x03000000 */
#define GPIO_MODER_MODE12              GPIO_MODER_MODE12_Msk                    /*!< [1:0]: Port x configuration I/O pin y (y=0 to 15)These bits are written by software to configure the I/O mode.Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_MODER_MODE13_Pos          (26U)
#define GPIO_MODER_MODE13_Msk          (0x3UL << GPIO_MODER_MODE13_Pos)          /*!< 0x0C000000 */
#define GPIO_MODER_MODE13              GPIO_MODER_MODE13_Msk                    /*!< [1:0]: Port x configuration I/O pin y (y=0 to 15)These bits are written by software to configure the I/O mode.Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_MODER_MODE14_Pos          (28U)
#define GPIO_MODER_MODE14_Msk          (0x3UL << GPIO_MODER_MODE14_Pos)          /*!< 0x30000000 */
#define GPIO_MODER_MODE14              GPIO_MODER_MODE14_Msk                    /*!< [1:0]: Port x configuration I/O pin y (y=0 to 15)These bits are written by software to configure the I/O mode.Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_MODER_MODE15_Pos          (30U)
#define GPIO_MODER_MODE15_Msk          (0x3UL << GPIO_MODER_MODE15_Pos)          /*!< 0xC0000000 */
#define GPIO_MODER_MODE15              GPIO_MODER_MODE15_Msk                    /*!< [1:0]: Port x configuration I/O pin y (y=0 to 15)These bits are written by software to configure the I/O mode.Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */

