zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211axx_ca35.h
/* Bit fields for RCC_SPI3CFGR register */
#define RCC_SPI3CFGR_SPI3RST_Pos                   (0U)
#define RCC_SPI3CFGR_SPI3RST_Msk                   (0x1UL << RCC_SPI3CFGR_SPI3RST_Pos)                  /*!< 0x00000001 */
#define RCC_SPI3CFGR_SPI3RST                       RCC_SPI3CFGR_SPI3RST_Msk                          /*!< SPI3 reset */
#define RCC_SPI3CFGR_SPI3EN_Pos                    (1U)
#define RCC_SPI3CFGR_SPI3EN_Msk                    (0x1UL << RCC_SPI3CFGR_SPI3EN_Pos)                   /*!< 0x00000002 */
#define RCC_SPI3CFGR_SPI3EN                        RCC_SPI3CFGR_SPI3EN_Msk                           /*!< SPI3 clock enable */
#define RCC_SPI3CFGR_SPI3LPEN_Pos                  (2U)
#define RCC_SPI3CFGR_SPI3LPEN_Msk                  (0x1UL << RCC_SPI3CFGR_SPI3LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_SPI3CFGR_SPI3LPEN                      RCC_SPI3CFGR_SPI3LPEN_Msk                         /*!< SPI3 clock enable during CSleep */

/* Bit fields for RCC_SPI4CFGR register */
#define RCC_SPI4CFGR_SPI4RST_Pos                   (0U)
#define RCC_SPI4CFGR_SPI4RST_Msk                   (0x1UL << RCC_SPI4CFGR_SPI4RST_Pos)                  /*!< 0x00000001 */
#define RCC_SPI4CFGR_SPI4RST                       RCC_SPI4CFGR_SPI4RST_Msk                          /*!< SPI4 reset */
#define RCC_SPI4CFGR_SPI4EN_Pos                    (1U)
#define RCC_SPI4CFGR_SPI4EN_Msk                    (0x1UL << RCC_SPI4CFGR_SPI4EN_Pos)                   /*!< 0x00000002 */
#define RCC_SPI4CFGR_SPI4EN                        RCC_SPI4CFGR_SPI4EN_Msk                           /*!< SPI4 clock enable */
#define RCC_SPI4CFGR_SPI4LPEN_Pos                  (2U)
#define RCC_SPI4CFGR_SPI4LPEN_Msk                  (0x1UL << RCC_SPI4CFGR_SPI4LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_SPI4CFGR_SPI4LPEN                      RCC_SPI4CFGR_SPI4LPEN_Msk                         /*!< SPI4 clock enable during CSleep */

/* Bit fields for RCC_SPI5CFGR register */
#define RCC_SPI5CFGR_SPI5RST_Pos                   (0U)
#define RCC_SPI5CFGR_SPI5RST_Msk                   (0x1UL << RCC_SPI5CFGR_SPI5RST_Pos)                  /*!< 0x00000001 */
#define RCC_SPI5CFGR_SPI5RST                       RCC_SPI5CFGR_SPI5RST_Msk                          /*!< SPI5 reset */
#define RCC_SPI5CFGR_SPI5EN_Pos                    (1U)
#define RCC_SPI5CFGR_SPI5EN_Msk                    (0x1UL << RCC_SPI5CFGR_SPI5EN_Pos)                   /*!< 0x00000002 */
#define RCC_SPI5CFGR_SPI5EN                        RCC_SPI5CFGR_SPI5EN_Msk                           /*!< SPI5 clock enable */
#define RCC_SPI5CFGR_SPI5LPEN_Pos                  (2U)
#define RCC_SPI5CFGR_SPI5LPEN_Msk                  (0x1UL << RCC_SPI5CFGR_SPI5LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_SPI5CFGR_SPI5LPEN                      RCC_SPI5CFGR_SPI5LPEN_Msk                         /*!< SPI5 clock enable during CSleep */

/* Bit fields for RCC_SPI6CFGR register */
#define RCC_SPI6CFGR_SPI6RST_Pos                   (0U)
#define RCC_SPI6CFGR_SPI6RST_Msk                   (0x1UL << RCC_SPI6CFGR_SPI6RST_Pos)                  /*!< 0x00000001 */
#define RCC_SPI6CFGR_SPI6RST                       RCC_SPI6CFGR_SPI6RST_Msk                          /*!< SPI6 reset */
#define RCC_SPI6CFGR_SPI6EN_Pos                    (1U)
#define RCC_SPI6CFGR_SPI6EN_Msk                    (0x1UL << RCC_SPI6CFGR_SPI6EN_Pos)                   /*!< 0x00000002 */
#define RCC_SPI6CFGR_SPI6EN                        RCC_SPI6CFGR_SPI6EN_Msk                           /*!< SPI6 clock enable */
#define RCC_SPI6CFGR_SPI6LPEN_Pos                  (2U)
#define RCC_SPI6CFGR_SPI6LPEN_Msk                  (0x1UL << RCC_SPI6CFGR_SPI6LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_SPI6CFGR_SPI6LPEN                      RCC_SPI6CFGR_SPI6LPEN_Msk                         /*!< SPI6 clock enable during CSleep */

/***************  Bit fields for RCC_SPDIFRXCFGR register */
#define RCC_SPDIFRXCFGR_SPDIFRXRST_Pos             (0U)
#define RCC_SPDIFRXCFGR_SPDIFRXRST_Msk             (0x1UL << RCC_SPDIFRXCFGR_SPDIFRXRST_Pos)            /*!< 0x00000001 */
#define RCC_SPDIFRXCFGR_SPDIFRXRST                 RCC_SPDIFRXCFGR_SPDIFRXRST_Msk                    /*!< SPDIFRX reset */
#define RCC_SPDIFRXCFGR_SPDIFRXEN_Pos              (1U)
#define RCC_SPDIFRXCFGR_SPDIFRXEN_Msk              (0x1UL << RCC_SPDIFRXCFGR_SPDIFRXEN_Pos)             /*!< 0x00000002 */
#define RCC_SPDIFRXCFGR_SPDIFRXEN                  RCC_SPDIFRXCFGR_SPDIFRXEN_Msk                     /*!< SPDIFRX clock enable */
#define RCC_SPDIFRXCFGR_SPDIFRXLPEN_Pos            (2U)
#define RCC_SPDIFRXCFGR_SPDIFRXLPEN_Msk            (0x1UL << RCC_SPDIFRXCFGR_SPDIFRXLPEN_Pos)           /*!< 0x00000004 */
#define RCC_SPDIFRXCFGR_SPDIFRXLPEN                RCC_SPDIFRXCFGR_SPDIFRXLPEN_Msk                   /*!< SPDIFRX clock enable during CSleep */

/* Bit fields for RCC_USART1CFGR register */
#define RCC_USART1CFGR_USART1RST_Pos               (0U)
#define RCC_USART1CFGR_USART1RST_Msk               (0x1UL << RCC_USART1CFGR_USART1RST_Pos)              /*!< 0x00000001 */
#define RCC_USART1CFGR_USART1RST                   RCC_USART1CFGR_USART1RST_Msk                      /*!< USART1 reset */
#define RCC_USART1CFGR_USART1EN_Pos                (1U)
#define RCC_USART1CFGR_USART1EN_Msk                (0x1UL << RCC_USART1CFGR_USART1EN_Pos)               /*!< 0x00000002 */
#define RCC_USART1CFGR_USART1EN                    RCC_USART1CFGR_USART1EN_Msk                       /*!< USART1 clock enable */
#define RCC_USART1CFGR_USART1LPEN_Pos              (2U)
#define RCC_USART1CFGR_USART1LPEN_Msk              (0x1UL << RCC_USART1CFGR_USART1LPEN_Pos)             /*!< 0x00000004 */
#define RCC_USART1CFGR_USART1LPEN                  RCC_USART1CFGR_USART1LPEN_Msk                     /*!< USART1 clock enable during CSleep */

/* Bit fields for RCC_USART2CFGR register */
#define RCC_USART2CFGR_USART2RST_Pos               (0U)
#define RCC_USART2CFGR_USART2RST_Msk               (0x1UL << RCC_USART2CFGR_USART2RST_Pos)              /*!< 0x00000001 */
#define RCC_USART2CFGR_USART2RST                   RCC_USART2CFGR_USART2RST_Msk                      /*!< USART2 reset */
#define RCC_USART2CFGR_USART2EN_Pos                (1U)
#define RCC_USART2CFGR_USART2EN_Msk                (0x1UL << RCC_USART2CFGR_USART2EN_Pos)               /*!< 0x00000002 */
#define RCC_USART2CFGR_USART2EN                    RCC_USART2CFGR_USART2EN_Msk                       /*!< USART2 clock enable */
#define RCC_USART2CFGR_USART2LPEN_Pos              (2U)
#define RCC_USART2CFGR_USART2LPEN_Msk              (0x1UL << RCC_USART2CFGR_USART2LPEN_Pos)             /*!< 0x00000004 */
#define RCC_USART2CFGR_USART2LPEN                  RCC_USART2CFGR_USART2LPEN_Msk                     /*!< USART2 clock enable during CSleep */

