zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211axx_ca35.h
/* Bit fields for RCC_IWDG1CFGR register */
#define RCC_IWDG1CFGR_IWDG1EN_Pos                  (1U)
#define RCC_IWDG1CFGR_IWDG1EN_Msk                  (0x1UL << RCC_IWDG1CFGR_IWDG1EN_Pos)                 /*!< 0x00000002 */
#define RCC_IWDG1CFGR_IWDG1EN                      RCC_IWDG1CFGR_IWDG1EN_Msk                         /*!< IWDG1 bus clock enable */
#define RCC_IWDG1CFGR_IWDG1LPEN_Pos                (2U)
#define RCC_IWDG1CFGR_IWDG1LPEN_Msk                (0x1UL << RCC_IWDG1CFGR_IWDG1LPEN_Pos)               /*!< 0x00000004 */
#define RCC_IWDG1CFGR_IWDG1LPEN                    RCC_IWDG1CFGR_IWDG1LPEN_Msk                       /*!< IWDG1 bus clock enable during CSleep */

/* Bit fields for RCC_IWDG2CFGR register */
#define RCC_IWDG2CFGR_IWDG2EN_Pos                  (1U)
#define RCC_IWDG2CFGR_IWDG2EN_Msk                  (0x1UL << RCC_IWDG2CFGR_IWDG2EN_Pos)                 /*!< 0x00000002 */
#define RCC_IWDG2CFGR_IWDG2EN                      RCC_IWDG2CFGR_IWDG2EN_Msk                         /*!< IWDG2 bus clock enable */
#define RCC_IWDG2CFGR_IWDG2LPEN_Pos                (2U)
#define RCC_IWDG2CFGR_IWDG2LPEN_Msk                (0x1UL << RCC_IWDG2CFGR_IWDG2LPEN_Pos)               /*!< 0x00000004 */
#define RCC_IWDG2CFGR_IWDG2LPEN                    RCC_IWDG2CFGR_IWDG2LPEN_Msk                       /*!< IWDG2 bus clock enable during CSleep */

/* Bit fields for RCC_IWDG3CFGR register */
#define RCC_IWDG3CFGR_IWDG3EN_Pos                  (1U)
#define RCC_IWDG3CFGR_IWDG3EN_Msk                  (0x1UL << RCC_IWDG3CFGR_IWDG3EN_Pos)                 /*!< 0x00000002 */
#define RCC_IWDG3CFGR_IWDG3EN                      RCC_IWDG3CFGR_IWDG3EN_Msk                         /*!< IWDG3 bus clock enable */
#define RCC_IWDG3CFGR_IWDG3LPEN_Pos                (2U)
#define RCC_IWDG3CFGR_IWDG3LPEN_Msk                (0x1UL << RCC_IWDG3CFGR_IWDG3LPEN_Pos)               /*!< 0x00000004 */
#define RCC_IWDG3CFGR_IWDG3LPEN                    RCC_IWDG3CFGR_IWDG3LPEN_Msk                       /*!< IWDG3 bus clock enable during CSleep */

/* Bit fields for RCC_IWDG4CFGR register */
#define RCC_IWDG4CFGR_IWDG4EN_Pos                  (1U)
#define RCC_IWDG4CFGR_IWDG4EN_Msk                  (0x1UL << RCC_IWDG4CFGR_IWDG4EN_Pos)                 /*!< 0x00000002 */
#define RCC_IWDG4CFGR_IWDG4EN                      RCC_IWDG4CFGR_IWDG4EN_Msk                         /*!< IWDG4 bus clock enable */
#define RCC_IWDG4CFGR_IWDG4LPEN_Pos                (2U)
#define RCC_IWDG4CFGR_IWDG4LPEN_Msk                (0x1UL << RCC_IWDG4CFGR_IWDG4LPEN_Pos)               /*!< 0x00000004 */
#define RCC_IWDG4CFGR_IWDG4LPEN                    RCC_IWDG4CFGR_IWDG4LPEN_Msk                       /*!< IWDG4 bus clock enable during CSleep */

/* Bit fields for RCC_WWDG1CFGR register */
#define RCC_WWDG1CFGR_WWDG1RST_Pos                 (0U)
#define RCC_WWDG1CFGR_WWDG1RST_Msk                 (0x1UL << RCC_WWDG1CFGR_WWDG1RST_Pos)                /*!< 0x00000001 */
#define RCC_WWDG1CFGR_WWDG1RST                     RCC_WWDG1CFGR_WWDG1RST_Msk                        /*!< WWDG1 reset */
#define RCC_WWDG1CFGR_WWDG1EN_Pos                  (1U)
#define RCC_WWDG1CFGR_WWDG1EN_Msk                  (0x1UL << RCC_WWDG1CFGR_WWDG1EN_Pos)                 /*!< 0x00000002 */
#define RCC_WWDG1CFGR_WWDG1EN                      RCC_WWDG1CFGR_WWDG1EN_Msk                         /*!< WWDG1 bus clock enable */
#define RCC_WWDG1CFGR_WWDG1LPEN_Pos                (2U)
#define RCC_WWDG1CFGR_WWDG1LPEN_Msk                (0x1UL << RCC_WWDG1CFGR_WWDG1LPEN_Pos)               /*!< 0x00000004 */
#define RCC_WWDG1CFGR_WWDG1LPEN                    RCC_WWDG1CFGR_WWDG1LPEN_Msk                       /*!< WWDG1 bus clock enable during CSleep */

/* Bit fields for RCC_VREFCFGR register */
#define RCC_VREFCFGR_VREFRST_Pos                   (0U)
#define RCC_VREFCFGR_VREFRST_Msk                   (0x1UL << RCC_VREFCFGR_VREFRST_Pos)                  /*!< 0x00000001 */
#define RCC_VREFCFGR_VREFRST                       RCC_VREFCFGR_VREFRST_Msk                          /*!< VREF reset */
#define RCC_VREFCFGR_VREFEN_Pos                    (1U)
#define RCC_VREFCFGR_VREFEN_Msk                    (0x1UL << RCC_VREFCFGR_VREFEN_Pos)                   /*!< 0x00000002 */
#define RCC_VREFCFGR_VREFEN                        RCC_VREFCFGR_VREFEN_Msk                           /*!< VREF clock enable */
#define RCC_VREFCFGR_VREFLPEN_Pos                  (2U)
#define RCC_VREFCFGR_VREFLPEN_Msk                  (0x1UL << RCC_VREFCFGR_VREFLPEN_Pos)                 /*!< 0x00000004 */
#define RCC_VREFCFGR_VREFLPEN                      RCC_VREFCFGR_VREFLPEN_Msk                         /*!< VREF clock enable during CSleep */

/* Bit fields for RCC_DTSCFGR register  ******************/
#define RCC_DTSCFGR_DTSRST_Pos                     (0U)
#define RCC_DTSCFGR_DTSRST_Msk                     (0x1UL << RCC_DTSCFGR_DTSRST_Pos)                    /*!< 0x00000001 */
#define RCC_DTSCFGR_DTSRST                         RCC_DTSCFGR_DTSRST_Msk                            /*!< DTS reset */
#define RCC_DTSCFGR_DTSEN_Pos                      (1U)
#define RCC_DTSCFGR_DTSEN_Msk                      (0x1UL << RCC_DTSCFGR_DTSEN_Pos)                   /*!< 0x00000002 */
#define RCC_DTSCFGR_DTSEN                          RCC_DTSCFGR_DTSEN_Msk                             /*!< DTS clock enable */
#define RCC_DTSCFGR_DTSLPEN_Pos                    (2U)
#define RCC_DTSCFGR_DTSLPEN_Msk                    (0x1UL << RCC_DTSCFGR_DTSLPEN_Pos)                   /*!< 0x00000004 */
#define RCC_DTSCFGR_DTSLPEN                        RCC_DTSCFGR_DTSLPEN_Msk                           /*!< DTS clock enable during CSleep */
#define RCC_DTSCFGR_DTSKERSEL_Pos                  (12U)
#define RCC_DTSCFGR_DTSKERSEL_Msk                  (0x3UL << RCC_DTSCFGR_DTSKERSEL_Pos)                 /*!< 0x00003000 */
#define RCC_DTSCFGR_DTSKERSEL                      RCC_DTSCFGR_DTSKERSEL_Msk                         /*!< DTS kernel clock selection */

/* Bit fields for RCC_CRCCFGR register  ******************/
#define RCC_CRCCFGR_CRCRST_Pos                     (0U)
#define RCC_CRCCFGR_CRCRST_Msk                     (0x1UL << RCC_CRCCFGR_CRCRST_Pos)                    /*!< 0x00000001 */
#define RCC_CRCCFGR_CRCRST                         RCC_CRCCFGR_CRCRST_Msk                            /*!< CRC reset */
#define RCC_CRCCFGR_CRCEN_Pos                      (1U)
#define RCC_CRCCFGR_CRCEN_Msk                      (0x1UL << RCC_CRCCFGR_CRCEN_Pos)                   /*!< 0x00000002 */
#define RCC_CRCCFGR_CRCEN                          RCC_CRCCFGR_CRCEN_Msk                             /*!< CRC clock enable */
#define RCC_CRCCFGR_CRCLPEN_Pos                    (2U)
#define RCC_CRCCFGR_CRCLPEN_Msk                    (0x1UL << RCC_CRCCFGR_CRCLPEN_Pos)                   /*!< 0x00000004 */
#define RCC_CRCCFGR_CRCLPEN                        RCC_CRCCFGR_CRCLPEN_Msk                           /*!< CRC clock enable during CSleep */

/* Bit fields for RCC_SERCCFGR register */
#define RCC_SERCCFGR_SERCRST_Pos                   (0U)
#define RCC_SERCCFGR_SERCRST_Msk                   (0x1UL << RCC_SERCCFGR_SERCRST_Pos)                  /*!< 0x00000001 */
#define RCC_SERCCFGR_SERCRST                     RCC_SERCCFGR_SERCRST_Msk                          /*!< SERC reset */
#define RCC_SERCCFGR_SERCEN_Pos                    (1U)
#define RCC_SERCCFGR_SERCEN_Msk                    (0x1UL << RCC_SERCCFGR_SERCEN_Pos)                   /*!< 0x00000002 */
#define RCC_SERCCFGR_SERCEN                      RCC_SERCCFGR_SERCEN_Msk                           /*!< SERC clocks enable */
#define RCC_SERCCFGR_SERCLPEN_Pos                  (2U)
#define RCC_SERCCFGR_SERCLPEN_Msk                  (0x1UL << RCC_SERCCFGR_SERCLPEN_Pos)                 /*!< 0x00000004 */
#define RCC_SERCCFGR_SERCLPEN                    RCC_SERCCFGR_SERCLPEN_Msk                         /*!< SERC clock enable during CSleep */

