zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211axx_ca35.h
/****************  Bit definition for USART_HWCFGR2 register  *****************/
#define USART_HWCFGR2_CFG1_Pos         (0U)
#define USART_HWCFGR2_CFG1_Msk         (0xFUL << USART_HWCFGR2_CFG1_Pos)    /*!< 0x0000000F */
#define USART_HWCFGR2_CFG1             USART_HWCFGR2_CFG1_Msk      /*!< USART hardware configuration 1 */
#define USART_HWCFGR2_CFG2_Pos         (4U)
#define USART_HWCFGR2_CFG2_Msk         (0xFUL << USART_HWCFGR2_CFG2_Pos)    /*!< 0x000000F0 */
#define USART_HWCFGR2_CFG2             USART_HWCFGR2_CFG2_Msk      /*!< USART hardware configuration 2 */
#define USART_HWCFGR2_CFG3_Pos         (8U)
#define USART_HWCFGR2_CFG3_Msk         (0xFUL << USART_HWCFGR2_CFG3_Pos)    /*!< 0x00000F00 */
#define USART_HWCFGR2_CFG3             USART_HWCFGR2_CFG3_Msk      /*!< USART hardware configuration 3 */

/****************  Bit definition for USART_HWCFGR1 register  *****************/
#define USART_HWCFGR1_CFG1_Pos         (0U)
#define USART_HWCFGR1_CFG1_Msk         (0xFUL << USART_HWCFGR1_CFG1_Pos)    /*!< 0x0000000F */
#define USART_HWCFGR1_CFG1             USART_HWCFGR1_CFG1_Msk      /*!< USART hardware configuration 1 */
#define USART_HWCFGR1_CFG2_Pos         (4U)
#define USART_HWCFGR1_CFG2_Msk         (0xFUL << USART_HWCFGR1_CFG2_Pos)    /*!< 0x000000F0 */
#define USART_HWCFGR1_CFG2             USART_HWCFGR1_CFG2_Msk      /*!< USART hardware configuration 2 */
#define USART_HWCFGR1_CFG3_Pos         (8U)
#define USART_HWCFGR1_CFG3_Msk         (0xFUL << USART_HWCFGR1_CFG3_Pos)    /*!< 0x00000F00 */
#define USART_HWCFGR1_CFG3             USART_HWCFGR1_CFG3_Msk      /*!< USART hardware configuration 3 */
#define USART_HWCFGR1_CFG4_Pos         (12U)
#define USART_HWCFGR1_CFG4_Msk         (0xFUL << USART_HWCFGR1_CFG4_Pos)    /*!< 0x0000F000 */
#define USART_HWCFGR1_CFG4             USART_HWCFGR1_CFG4_Msk      /*!< USART hardware configuration 4 */
#define USART_HWCFGR1_CFG5_Pos         (16U)
#define USART_HWCFGR1_CFG5_Msk         (0xFUL << USART_HWCFGR1_CFG5_Pos)    /*!< 0x000F0000 */
#define USART_HWCFGR1_CFG5             USART_HWCFGR1_CFG5_Msk      /*!< USART hardware configuration 5 */
#define USART_HWCFGR1_CFG6_Pos         (20U)
#define USART_HWCFGR1_CFG6_Msk         (0xFUL << USART_HWCFGR1_CFG6_Pos)    /*!< 0x00F00000 */
#define USART_HWCFGR1_CFG6             USART_HWCFGR1_CFG6_Msk      /*!< USART hardware configuration 6 */
#define USART_HWCFGR1_CFG7_Pos         (24U)
#define USART_HWCFGR1_CFG7_Msk         (0xFUL << USART_HWCFGR1_CFG7_Pos)    /*!< 0x0F000000 */
#define USART_HWCFGR1_CFG7             USART_HWCFGR1_CFG7_Msk      /*!< USART hardware configuration 7 */
#define USART_HWCFGR1_CFG8_Pos         (28U)
#define USART_HWCFGR1_CFG8_Msk         (0xFUL << USART_HWCFGR1_CFG8_Pos)    /*!< 0xF0000000 */
#define USART_HWCFGR1_CFG8             USART_HWCFGR1_CFG8_Msk      /*!< USART hardware configuration 8  */

/******************  Bit definition for USART_VERR register  ******************/
#define USART_VERR_MINREV_Pos          (0U)
#define USART_VERR_MINREV_Msk          (0xFUL << USART_VERR_MINREV_Pos)   /*!< 0x0000000F */
#define USART_VERR_MINREV              USART_VERR_MINREV_Msk       /*!< Minor revision */
#define USART_VERR_MAJREV_Pos          (4U)
#define USART_VERR_MAJREV_Msk          (0xFUL << USART_VERR_MAJREV_Pos)   /*!< 0x000000F0 */
#define USART_VERR_MAJREV              USART_VERR_MAJREV_Msk       /*!< Major revision */

/*****************  Bit definition for USART_IPIDR register  ******************/
#define USART_IPIDR_ID_Pos             (0U)
#define USART_IPIDR_ID_Msk             (0xFFFFFFFFUL << USART_IPIDR_ID_Pos)       /*!< 0xFFFFFFFF */
#define USART_IPIDR_ID                 USART_IPIDR_ID_Msk          /*!< Peripheral identifier */

/******************  Bit definition for USART_SIDR register  ******************/
#define USART_SIDR_SID_Pos             (0U)
#define USART_SIDR_SID_Msk             (0xFFFFFFFFUL << USART_SIDR_SID_Pos)       /*!< 0xFFFFFFFF */
#define USART_SIDR_SID                 USART_SIDR_SID_Msk          /*!< Size identification  */

/******************************************************************************/
/*                                                                            */
/*                                       USBH_EHCI                              */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for USBH_EHCI_HCCAPBASE register  ********************/
#define USBH_EHCI_HCCAPBASE_CAPLENGTH_Pos        (0U)
#define USBH_EHCI_HCCAPBASE_CAPLENGTH_Msk        (0x7FU << USBH_EHCI_HCCAPBASE_CAPLENGTH_Pos)      /*!< 0x0000007F */
#define USBH_EHCI_HCCAPBASE_CAPLENGTH            USBH_EHCI_HCCAPBASE_CAPLENGTH_Msk                 /*!< Capability Register Length */

#define USBH_EHCI_HCCAPBASE_HCIVERSION_Pos       (16U)
#define USBH_EHCI_HCCAPBASE_HCIVERSION_Msk       (0xFFFF0000U << USBH_EHCI_HCCAPBASE_HCIVERSION_Pos) /*!< 0xFFFF0000U */
#define USBH_EHCI_HCCAPBASE_HCIVERSION           USBH_EHCI_HCCAPBASE_HCIVERSION_Msk                  /*!< Capability Register Length */

/********************  Bit definition for USBH_EHCI_HCSPARAMS register  ********************/
#define USBH_EHCI_HCSPARAMS_N_PORTS_Pos    (0U)
#define USBH_EHCI_HCSPARAMS_N_PORTS_Msk    (0xFU << USBH_EHCI_HCSPARAMS_N_PORTS_Pos)         /*!< 0x0000000F */
#define USBH_EHCI_HCSPARAMS_N_PORTS        USBH_EHCI_HCSPARAMS_N_PORTS_Msk                   /*!< Number of Ports */

#define USBH_EHCI_HCSPARAMS_PPC_Pos        (4U)
#define USBH_EHCI_HCSPARAMS_PPC_Msk        (0x1U << USBH_EHCI_HCSPARAMS_PPC_Pos)             /*!< 0x00000010 */
#define USBH_EHCI_HCSPARAMS_PPC            USBH_EHCI_HCSPARAMS_PPC_Msk                       /*!< Port Power Control */

#define USBH_EHCI_HCSPARAMS_PRR_Pos        (7U)
#define USBH_EHCI_HCSPARAMS_PRR_Msk        (0x1U << USBH_EHCI_HCSPARAMS_PRR_Pos)             /*!< 0x00000080 */
#define USBH_EHCI_HCSPARAMS_PRR            USBH_EHCI_HCSPARAMS_PRR_Msk                       /*!< Port Routing Rules */

#define USBH_EHCI_HCSPARAMS_N_PCC_Pos      (8U)
#define USBH_EHCI_HCSPARAMS_N_PCC_Msk      (0xFU << USBH_EHCI_HCSPARAMS_N_PCC_Pos)           /*!< 0x00000F00 */
#define USBH_EHCI_HCSPARAMS_N_PCC          USBH_EHCI_HCSPARAMS_N_PCC_Msk                     /*!< Number of Ports per Companion Controller */

#define USBH_EHCI_HCSPARAMS_N_CC_Pos       (12U)
#define USBH_EHCI_HCSPARAMS_N_CC_Msk       (0xFU << USBH_EHCI_HCSPARAMS_N_CC_Pos)            /*!< 0x0000F000 */
#define USBH_EHCI_HCSPARAMS_N_CC           USBH_EHCI_HCSPARAMS_N_CC_Msk                      /*!< Number of Companion Controller */

#define USBH_EHCI_HCSPARAMS_P_INDICATOR_Pos (16U)
#define USBH_EHCI_HCSPARAMS_P_INDICATOR_Msk (0x1U << USBH_EHCI_HCSPARAMS_P_INDICATOR_Pos)    /*!< 0x00010000 */
#define USBH_EHCI_HCSPARAMS_P_INDICATOR    USBH_EHCI_HCSPARAMS_P_INDICATOR_Msk               /*!< Port Indicators */

#define USBH_EHCI_HCSPARAMS_DPN_Pos        (20U)
#define USBH_EHCI_HCSPARAMS_DPN_Msk        (0xFU << USBH_EHCI_HCSPARAMS_DPN_Pos)             /*!< 0x00F00000 */
#define USBH_EHCI_HCSPARAMS_DPN            USBH_EHCI_HCSPARAMS_DPN_Msk                       /*!< Debug Port Number */

/********************  Bit definition for USBH_EHCI_HCCPARAMS register  ********************/
#define USBH_EHCI_HCCPARAMS_SFAC_Pos      (0U)
#define USBH_EHCI_HCCPARAMS_SFAC_Msk      (0x1U << USBH_EHCI_HCCPARAMS_SFAC_Pos)           /*!< 0x00000001 */
#define USBH_EHCI_HCCPARAMS_SFAC          USBH_EHCI_HCCPARAMS_SFAC_Msk                     /*!< 64-bit Addressing Capability */

#define USBH_EHCI_HCCPARAMS_PFLF_Pos       (1U)
#define USBH_EHCI_HCCPARAMS_PFLF_Msk       (0x1U << USBH_EHCI_HCCPARAMS_PFLF_Pos)            /*!< 0x00000002 */
#define USBH_EHCI_HCCPARAMS_PFLF           USBH_EHCI_HCCPARAMS_PFLF_Msk                      /*!< Programmable Frame List Flag */

#define USBH_EHCI_HCCPARAMS_ASPC_Pos       (2U)
#define USBH_EHCI_HCCPARAMS_ASPC_Msk       (0x1U << USBH_EHCI_HCCPARAMS_ASPC_Pos)            /*!< 0x00000004 */
#define USBH_EHCI_HCCPARAMS_ASPC           USBH_EHCI_HCCPARAMS_ASPC_Msk                      /*!< Asynchronous Schedule Park Capability */

